// Сгенерировано scripts/generate.mjs из specs/. Не править руками.
/* eslint-disable */
export interface paths {
  '/agency/balance': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    get?: never
    put?: never
    /**
     * Перевод средств на счёт клиента
     * @description Данный метод выполняет перевод средств агентства на счёт клиента (актуально для рекламной модели).
     *     При пополнении счёта клиента должны совпадать ИНН и КПП для:
     *
     *     - аккаунта, от имени которого выполняется запрос;
     *     - аккаунта, на чей счёт нужно перевести средства;
     *     - платежа, из которого берётся указанная сумма.
     *
     *     ### Параметры тела запроса
     *
     *     - `userId` — идентификатор клиента, на счёт которого переводятся средства.
     *     - `amount` — сумма перевода в рублях.
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад информацию о созданной транзакции:
     *
     *     - `result.transactionId` — идентификатор транзакции,
     *       с помощью которого можно получить информацию о транзакции
     *       (см. метод [Получение информации о транзакции](#operation/agencyTransaction)).
     *     - `result.status` — статус транзакции.
     *     - `result.reason` — причина текущего статуса транзакции.
     *
     *     В случае успеха статус будет иметь значение `processing` — транзакция в процессе обработки.
     *     Если же при создании транзакции возникает ошибка, то статус будет иметь значение `error`.
     *     В таком случае необходимо обратиться в службу поддержки,
     *       указав в обращении в том числе значение параметра `result.reason`.
     */
    post: operations['agencyBalance']
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/agency/transactions': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    /**
     * Получение списка незавершённых транзакций
     * @description Данный метод позволяет получить список незавершённых транзакций.
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад массив незавершённых транзакций `result`.
     *
     *     #### Транзакция
     *
     *     В данных транзакции возвращается её идентификатор `transactionId` и статус `status`.
     *     По идентификатору транзакции с помощью метода
     *       [Получение информации о транзакции](#operation/agencyTransaction) можно получить сообщение об ошибке,
     *       если её статус имеет значение `error`.
     *
     *     #### Статус транзакции
     *
     *     - `success` — перевод средств успешно завершён.
     *     - `processing` — транзакция создана, но её обработка ещё не завершена.
     *     - `error` — при обработке транзакции произошла ошибка.
     */
    get: operations['agencyTransactions']
    put?: never
    post?: never
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/agency/transactions/{transaction_id}': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    /**
     * Получение информации о транзакции
     * @description Данный метод позволяет получить информацию о транзакции.
     *
     *     ### Параметры тела запроса
     *
     *     - `transactionId` — идентификатор транзакции
     *       (см. метод [Перевод средств на счёт клиента](#operation/agencyBalance)).
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад идентификатор транзакции `result.transactionId` и её статус `result.status`.
     *     Если статус имеет значение `error`, то также возвращается сообщение об ошибке `result.message`.
     *
     *     #### Статус транзакции
     *
     *     - `success` — перевод средств успешно завершён.
     *     - `processing` — транзакция создана, но её обработка ещё не завершена.
     *     - `error` — при обработке транзакции произошла ошибка.
     *
     *     #### Сообщение об ошибке
     *
     *     - «transfer not found» — транзакция с заданным `transactionId` не найдена.
     *     - «Недостаточно средств у рекламного агентства» — транзакцию не удалось выполнить из-за того,
     *       что все предварительно внесённые средства исчерпаны.
     *     - любой другой текст — внутренняя ошибка. Следует обратиться в службу поддержки.
     */
    get: operations['agencyTransaction']
    put?: never
    post?: never
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/api/1/agency/clients': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    get?: never
    put?: never
    /**
     * Получение списка клиентов
     * @description Данный метод позволяет получить список клиентов агентства с дополнительной информацией о них.
     *
     *     ### Параметры тела запроса
     *
     *     - `limit` — инструмент пагинации, ограничивает количество клиентов в ответе (максимум 100).
     *     - `offset` — инструмент пагинации, выполняет смещение, с которого начинается выборка клиентов (по умолчанию 0).
     *     - `extra` — настройка дополнительной информации, если нужно включить её в ответ.
     *
     *     #### Дополнительная информация о клиентах
     *
     *     Можно включить в список клиентов дополнительную информацию о них,
     *       установив в `true` необходимые опции `extra`:
     *
     *     - `balance` — текущий баланс Кошелька клиента.
     *     - `subscription` — текущая подписка клиента.
     *     - `advance` — остаток аванса тарифа клиента, если есть.
     *     - `statistics` — статистика клиента (расходы, количество объявлений, просмотров и контактов).
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад список клиентов `result.clients` и общее количество клиентов агентства `result.total`.
     *
     *     #### Клиент
     *
     *     - `clientId` — идентификатор аккаунта клиента, прикреплённого к агентству.
     *     - `mainUserId` — идентификатор принявшего приглашение клиента
     *       (возвращается только для связи по рекламной модели).
     *     - `name` — наименование клиента.
     *     - `status` — статус клиента: `active` — активный, `new` — новый клиент, ещё не принял приглашение агентства.
     *     - `linkType` — тип связи клиента с агентством: `adv` — по рекламной, `trx` — по транзакционной модели.
     *     - `linkTime` — время прикрепления клиента к агентству в формате RFC3339.
     *
     *     Если был запрошен текущий баланс Кошелька клиента,
     *       то также возвращается сумма баланса `balance.amount` в копейках.
     *
     *     Если была запрошена текущая подписка клиента,
     *       то также возвращается информация `subscription` со следующими данными:
     *
     *     - `category` — категория подписки клиента.
     *     - `level` — уровень подписки клиента.
     *     - `isActive` — активна (оплачена) ли подписка клиента.
     *     - `expiredTo` — к какому времени закончится текущий период активной подписки клиента.
     *
     *     Если был запрошен остаток аванса тарифа клиента,
     *       то также возвращается сумма аванса `advance.amount` в копейках.
     *
     *     Если была запрошена статистика клиента, то также возвращается информация `statistics` со следующими данными:
     *
     *     - `spendings` — сумма расходов клиента в копейках.
     *     - `activeItems` — количество объявлений клиента.
     *     - `views` — количество просмотров объявлений клиента.
     *     - `clicks` — количество контактов клиента.
     *
     *     #### Категория подписки
     *
     *     - `auto` — Транспорт.
     *     - `realty` — Недвижимость.
     *     - `job` — Работа.
     *     - `services` — Услуги.
     *     - `goods` — Товары.
     *
     *     #### Уровень подписки
     *
     *     - `basic` — базовая подписка.
     *     - `extended` — расширенная подписка.
     *     - `maximal` — максимальная подписка.
     *     - `ultra` — ультра-подписка.
     */
    post: operations['agencyClients']
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/api/1/agency/clients/target/create': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    get?: never
    put?: never
    /**
     * Создание задачи на проверку ИНН клиентов
     * @description Данный метод запускает задачу на проверку ИНН клиентов.
     *
     *     ### Параметры запроса
     *
     *     - `innList` — не пустой список до 100 ИНН.
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад идентификатор задачи `result.taskId`,
     *       с помощью которого можно будет получить её статус и результаты проверки
     *       (см. метод [Получение результата проверки ИНН клиентов](#operation/agencyClientsTargetResult)).
     */
    post: operations['agencyClientsTargetCreate']
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/api/1/agency/clients/target/result': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    get?: never
    put?: never
    /**
     * Получение результата проверки ИНН клиентов
     * @description Данный метод позволяет получить по идентификатору статус задачи проверки ИНН клиентов,
     *       а также результаты этой проверки, если задача завершилась успешно.
     *
     *     ### Параметры тела запроса
     *
     *     - `taskId` — идентификатор задачи
     *       (см. метод [Создание задачи на проверку ИНН клиентов](#operation/agencyClientsTargetCreate)).
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад статус задачи `result.status` и итог проверки `result.items`,
     *       если задача успешно завершена.
     *
     *     #### Статус задачи
     *
     *     - `pending` — задача ещё в процессе выполнения.
     *     - `success` — задача успешно завершена.
     *
     *     #### Итог проверки
     *
     *     Итог проверки представлен массивом результатов по каждому из исходного списка ИНН:
     *
     *     - `inn` — проверенный ИНН.
     *     - `isError` — была ли ошибка при проверке.
     *       Если да, то результат проверки такого ИНН следует игнорировать.
     *     - `results` — результаты проверки ИНН по категориям.
     *
     *     Результаты представлены массивом статусов в категориях:
     *
     *     - `category` — категория.
     *     - `status` — статус ИНН в категории.
     *
     *     #### Категория
     *
     *     - `goods` — Товары.
     *     - `services` —Услуги.
     *     - `machinery` — Спецтехника.
     *     - `jobs` — Работа.
     *
     *     #### Статус ИНН
     *
     *     - `new` — «Новый»: клиент,
     *       у которого были нулевые или незначительные траты на Авито до подключения к агентству.
     *     - `uplift` — «Аплифт»: клиент, который уже пользовался платными услугами до подключения к агентству,
     *       комиссия может начисляться только с роста его расходов на услуги размещения.
     *     - `unavailable` — «Недоступен»: клиент недоступен для работы с агентствами в данной категории.
     *       Для подключения клиента в других категориях свяжитесь с менеджером.
     */
    post: operations['agencyClientsTargetResult']
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/api/1/agency/finances/balance': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    /**
     * Получение баланса агентства
     * @description Данный метод позволяет получить текущий баланс средств агентства.
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад информацию о балансе агентства `result`:
     *
     *     - `full` — сумма полного баланса средств агентства в копейках.
     *     - `pending` — сумма баланса средств агентства, находящихся «в обработке», в копейках.
     */
    get: operations['agencyFinancesBalance']
    put?: never
    post?: never
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/api/1/agency/finances/transactionsHistory': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    get?: never
    put?: never
    /**
     * Получение всех операций с балансом агентства
     * @description Данный метод позволяет получить список всех операций с балансом средств агентства.
     *
     *     ### Параметры тела запроса
     *
     *     - `dateFrom` — дата в формате RFC3339, с которой требуется получить операции с балансом.
     *     - `dateTo` — дата в формате RFC3339, по которую требуется получить операции с балансом.
     *     - `limit` — инструмент пагинации, ограничивает количество операций в ответе (максимум 1000).
     *     - `offset` — инструмент пагинации, выполняет смещение, с которого начинается выборка операций.
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад список транзакций `result.items` — операции с балансом средств агентства.
     *
     *     #### Транзакция
     *
     *     Транзакция содержит в себе следующую информацию:
     *
     *     - `transactionId` — идентификатор транзакции.
     *     - `operationDateTime` — дата и время проведения транзакции.
     *     - `amount` — сумма транзакции в копейках.
     *     - `status` — статус транзакции.
     *     - `clientId` — идентификатор клиента, которому был совершён перевод.
     *       Если не указан, значит, транзакция является пополнением баланса агентства.
     *
     *     #### Статус транзакции
     *
     *     - `success` — транзакция успешно завершена.
     *     - `pending` — транзакция в обработке.
     *     - `failed` — при обработке транзакции произошла ошибка.
     *     - `blocked` — попытка провести транзакцию за 2 дня до окончания отчётного периода.
     *       Такие транзакции не выполняются.
     */
    post: operations['agencyFinancesTransactionsHistory']
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/api/1/agency/users/invite/send': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    get?: never
    put?: never
    /**
     * Отправка приглашения нового клиента
     * @description Данный метод отправляет приглашение новому клиенту.
     *
     *     ### Параметры тела запроса
     *
     *     - `userId` — идентификатор приглашаемого пользователя.
     *     - `type` — тип необходимой связи клиента с агентством: `adv` — по рекламной, `trx` — по транзакционной модели.
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад идентификатор приглашения `result.inviteId`,
     *       с помощью которого можно будет получить его статус
     *       (см. метод [Получение статуса приглашения нового клиента](#operation/agencyUsersInviteStatus)),
     *       а также статус верификации рекламного аккаунта клиента
     *       (см. метод [Получение статуса верификации нового клиента](#operation/agencyUsersVerificationStatus)).
     */
    post: operations['agencyUsersInviteSend']
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/api/1/agency/users/invite/status': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    get?: never
    put?: never
    /**
     * Получение статуса приглашения нового клиента
     * @description Данный метод позволяет получить статус отправленного приглашения нового клиента.
     *
     *     ### Параметры тела запроса
     *
     *     - `inviteId` — идентификатор отправленного приглашения
     *       (см. метод [Отправка приглашения нового клиента](#operation/agencyUsersInviteSend)).
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад статус приглашения `result.status`:
     *
     *     - `pending` — приглашение ожидает подтверждения клиентом.
     *     - `success` — приглашение успешно подтверждено.
     *     - `decline` — приглашение отклонено клиентом.
     */
    post: operations['agencyUsersInviteStatus']
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/api/1/agency/users/verificationStatus': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    get?: never
    put?: never
    /**
     * Получение статуса верификации нового клиента
     * @description Данный метод позволяет получить статус верификации подтвердившего приглашение клиента.
     *
     *     ### Параметры тела запроса
     *
     *     - `inviteId` — идентификатор приглашения клиента
     *       (см. метод [Отправка приглашения нового клиента](#operation/agencyUsersInviteSend)).
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад статус приглашения `result.status`:
     *
     *     - `verified` — клиент верифицирован.
     *     - `not-verified` — клиент ещё не верифицирован.
     *
     *     В том числе метод возвращает идентификатор подтвердившего приглашение клиента `result.userId`.
     *     Если при приглашении был указан тип связи по рекламной модели
     *       (см. метод [Отправка приглашения нового клиента](#operation/agencyUsersInviteSend)),
     *       то также возвращается идентификатор рекламного аккаунта клиента `result.agencyClientUserId`.
     */
    post: operations['agencyUsersVerificationStatus']
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/core/v1/accounts/{user_id}/items/{item_id}/': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    /**
     * Получение информации по объявлению клиента
     * @description Данный метод позволяет получить информацию по объявлению клиента.
     *     Необходимо указать идентификатор нужного объявления в качестве значения параметра URL `item_id`.
     *
     *     ### Доступ к данным клиента
     *
     *     Для того, чтобы получить данные объявления конкретного клиента,
     *       необходимо указать идентификатор аккаунта клиента в качестве значения параметра URL `user_id`,
     *       а также значения заголовка `X-AgencyClientId`!
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад URL объявления `url`, статус на сайте `status`,
     *     список применённых к объявлению платных услуг `vas`,
     *     а также даты и время создания `start_time` и завершения объявления `finish_time` в формате RFC3339, если есть.
     *     В том числе возвращается идентификатор объявления из файла автозагрузки `autoload_item_id`,
     *     если использовался соответствующий инструмент
     *     (см. [инструкцию Автозагрузки](https://www.avito.ru/autoload/documentation#WhatIsAutoload)).
     *
     *     #### Статус объявления
     *
     *     - `active` — объявление активно.
     *     - `removed` — объявление удалено пользователем в архив или навсегда.
     *     - `old` — истёк срок публикации объявления, или объявление закрыто пользователем.
     *     - `blocked` — объявление заблокировано.
     *     - `rejected` — объявление отклонено.
     *
     *     #### Применённая платная услуга
     *
     *     Применённая к объявлению платная услуга содержит в себе следующую информацию:
     *
     *     - `vas_id` — идентификатор (слаг) услуги.
     *     - `finish_time` — дата и время окончания услуги в формате RFC3339, если есть.
     *
     *     ### Примечания
     *
     *     - Метод имеет ограничение до 500 запросов в минуту.
     */
    get: operations['coreItem']
    put?: never
    post?: never
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/core/v1/items': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    /**
     * Получение информации по объявлениям клиента
     * @description Данный метод позволяет получить информацию по объявлениям клиента.
     *
     *     ### Доступ к данным клиента
     *
     *     Для того, чтобы получить данные объявлений конкретного клиента,
     *       необходимо указать идентификатор аккаунта клиента в качестве значения заголовка `X-AgencyClientId`!
     *
     *     ### Параметры запроса
     *
     *     Добавьте следующие ограничения, если нужно отфильтровать объявления:
     *
     *     - `status` — по статусу объявления.
     *     - `category` — по категории (идентификатор).
     *       См. доступные значения в
     *       [Справочнике идентификаторов категорий](https://www.avito.st/s/openapi/catalog-categories.xml).
     *     - `updatedAtFrom` — c даты обновления/редактирования объявления в формате `YYYY-MM-DD`.
     *
     *     Добавьте следующие опции, если нужно настроить пагинацию:
     *
     *     - `per_page` — количество объявлений на странице (от 1 до 100, по умолчанию 25).
     *     - `page` — номер страницы (минимум 1, по умолчанию 1).
     *
     *     #### Статус объявления
     *
     *     - `active` — объявление активно.
     *     - `removed` — объявление удалено пользователем в архив или навсегда.
     *     - `old` — истёк срок публикации объявления, или объявление закрыто пользователем.
     *     - `blocked` — объявление заблокировано.
     *     - `rejected` — объявление отклонено.
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад список объявлений `resources` и мета-информацию `meta`.
     *
     *     #### Объявление
     *
     *     Объявление содержит в себе следующую информацию:
     *
     *     - `id` — идентификатор объявления.
     *     - `url` — URL объявления.
     *     - `title` — название объявления.
     *     - `price` — цена объявления. Отсутствует, если цена не была указана.
     *     - `address` — адрес объявления.
     *     - `category` — информация о категории объявления: `id` — идентификатор, `name` — название категории.
     *     - `status` — статус объявления.
     *
     *     #### Мета-информация
     *
     *     Мета-информация содержит в себе:
     *
     *     - `per_page` — заданное запросом количество объявлений на странице.
     *     - `page` — номер страницы.
     *
     *     ### Примечания
     *
     *     - Метод имеет ограничение до 25 запросов в минуту.
     */
    get: operations['coreItems']
    put?: never
    post?: never
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/stats/v2/accounts/{user_id}/items': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    get?: never
    put?: never
    /**
     * Получение статистических показателей клиента
     * @description Данный метод позволяет получить различные статистические показатели объявлений клиента.
     *
     *     ### Доступ к данным клиента
     *
     *     Для того, чтобы получить данные статистики конкретного клиента,
     *       необходимо указать идентификатор аккаунта клиента в качестве значения параметра URL `user_id`,
     *       а также значения заголовка `X-AgencyClientId`!
     *
     *     ### Параметры тела запроса
     *
     *     - `dateFrom` — дата в формате `YYYY-MM-DD`, с которой требуется получить статистику.
     *     - `dateTo` — дата в формате `YYYY-MM-DD`, по которую требуется получить статистику (включительно).
     *     - `grouping` — группировка показателей.
     *     - `metrics` — набор необходимых показателей.
     *
     *     Добавьте ограничения `filter`, если нужно отфильтровать данные статистики:
     *
     *     - `categoryIDs` — по категориям (идентификаторы). См. доступные значения в
     *       [Справочнике идентификаторов категорий](https://www.avito.st/s/openapi/catalog-categories.xml).
     *     - `employeeIDs` — по сотрудникам (идентификаторы).
     *       См. метод [Получение списка сотрудников иерархии](#operation/getEmployeesV1).
     *
     *     Добавьте следующие опции, если нужно настроить пагинацию:
     *
     *     - `limit` — ограничивает количество сущностей статистики в ответе (максимум 1000).
     *     - `offset` — выполняет смещение, с которого начинается выборка данных статистики.
     *     - `sort` — сортировка данных статистики. Задается массивом настроек:
     *       `key` — показатель, `order` — порядок сортировки: `asc` — в порядке возрастания, `desc` — убывания.
     *
     *     #### Группировка показателей
     *
     *     - `day` — группировка по дням.
     *     - `week` — группировка по неделям.
     *     - `month` — группировка по месяцам.
     *     - `totals` — группировка по общему значению показателя за определённый период, без детализации.
     *
     *     #### Показатель
     *
     *     Основные показатели:
     *
     *     - `views` — просмотры. Сколько раз объявление показывалось в результатах поиска и рекомендациях.
     *       Несколько показов за сутки одному пользователю считаются как один.
     *     - `contacts` — контакты. Количество пользователей, которые посмотрели ваш номер,
     *       написали в чат или откликнулись на скидку после рассылки.
     *       Несколько контактов за сутки от одного пользователя считаются как один.
     *     - `contactsShowPhone` — посмотрели телефон. Количество пользователей,
     *       которые посмотрели ваш телефон или нажали «Позвонить».
     *       Несколько таких действий за сутки от одного пользователя считаются как один.
     *     - `contactsMessenger` — написали в чат. Количество пользователей, которые написали вам.
     *       Несколько чатов за сутки от одного пользователя считаются как один.
     *     - `contactsShowPhoneAndMessenger` — посмотрели телефон и написали в чат.
     *       Количество пользователей, которые и посмотрели ваш телефон, и написали в чат.
     *       Несколько таких действий за сутки от одного пользователя считаются как один.
     *     - `contactsSbcDiscount` — откликнулись на скидку в чате.
     *       Количество пользователей, которые приняли ваше спецпредложение после рассылки.
     *     - `viewsToContactsConversion` — конверсия из просмотров в контакты.
     *       Процент пользователей, которые после перехода в объявление посмотрели ваш телефон или написали в чат.
     *     - `favorites` — добавили в избранное. Сколько раз объявление добавили в избранное.
     *     - `averageViewCost` — средняя цена просмотра.
     *       Расходы на размещение и продвижение объявлений делятся на число просмотров.
     *     - `averageContactCost` — средняя цена контакта.
     *       Расходы на размещение и продвижение объявлений делятся на число контактов.
     *     - `impressions` — показы. Сколько раз объявление показывалось в результатах поиска и рекомендациях.
     *       Несколько показов за сутки одному пользователю считаются как один.
     *     - `impressionsToViewsConversion` — конверсия из показов в просмотры. Процент пользователей,
     *       которые перешли в объявление после того, как оно показалось в результатах поиска и рекомендациях.
     *
     *     Целевые действия:
     *
     *     - `clickPackages` — целевые просмотры. Просмотры,
     *       которые оплачены из тарифа и считаются целевыми по правилам Авито.
     *     - `jobContacts` — отклики на вакансии. Отклики,
     *       которые оплачены из тарифа и считаются целевыми по правилам Авито.
     *
     *     Заказы товаров с Авито Доставкой:
     *
     *     - `viewsToOrderedItemsConversion` — конверсия из просмотров в заказанные товары.
     *       Процент пользователей, которые после перехода в объявление заказали товар.
     *     - `orderedItems` — заказано товаров. Количество товаров, которые заказали с Авито Доставкой.
     *     - `orderedItemsPrice` — стоимость заказанных товаров в копейках. Общая стоимость заказов.
     *       Это сумма, которую вы получите на руки, если клиенты примут заказы.
     *     - `deliveredItems` — доставлено товаров. Количество товаров, которые заказали с Авито Доставкой и уже приняли.
     *     - `deliveredItemsPrice` — стоимость доставленных товаров в копейках.
     *       Общая стоимость заказов, которые покупатели приняли. Это сумма, которую вы получаете на руки.
     *
     *     Посуточная аренда недвижимости:
     *
     *     - `bookingPlacedCount` — получено заявок. Общее количество заявок на бронирование.
     *     - `bookingPlacedPrice` — стоимость полученных заявок в копейках. Общая стоимость бронирований.
     *       Это сумма, которую вы получите на руки, если гости заселятся.
     *     - `bookingApprovedCount` — подтверждено заявок. Количество заявок на бронирование, которые вы подтвердили.
     *     - `bookingApprovedPrice` — стоимость подтвержденных заявок в копейках.
     *       Общая стоимость бронирований, которые вы подтвердили.
     *       Это сумма, которую вы получите на руки, если гости заселятся.
     *     - `bookingAcceptedCount` — заявки с заселением. Количество бронирований, по которым заселились гости.
     *       Заселение засчитывается в 15:00 по Москве на следующий день после заезда.
     *     - `bookingAcceptedPrice` — стоимость заявок с заселением в копейках.
     *       Общая стоимость бронирований, по которым заселились гости. Это сумма, которую вы получаете на руки.
     *
     *     Расходы:
     *
     *     - `allSpending` — все расходы в копейках. Сколько всего денег и бонусов вы потратили на объявления.
     *     - `spending` — расходы на объявления в копейках.
     *       Сколько денег вы потратили на размещение, продвижение, целевые действия и комиссию.
     *     - `presenceSpending` — расходы на размещение и целевые действия в копейках.
     *       Сколько денег вы потратили на размещения и целевые действия — просмотры, чаты, звонки и отклики.
     *     - `promoSpending` — расходы на продвижение в копейках.
     *       Сколько денег вы потратили на продвижение и на услуги, которые влияют на внешний вид объявления.
     *     - `restSpending` — остальные расходы в копейках.
     *       Сколько денег вы потратили на чат-ботов и услуги, которые система не смогла распознать.
     *     - `commission` — комиссия в копейках. Какую комиссию вы заплатили за заказы с Авито Доставкой,
     *       которые приняли покупатели, а также за бронирования жилья.
     *     - `spendingBonus` — списано бонусов на объявления.
     *       Сколько бонусов вы потратили на размещение, продвижение, целевые действия и комиссию.
     *
     *     Количество объявлений за период:
     *
     *     - `activeItems` — активные объявления. Объявления, которые прошли проверку и появились в поиске.
     *     - `newActiveItems` — новые и опубликованные заново объявления.
     *       Сколько объявлений опубликовано впервые или повторно.
     *     - `oldActiveItems` — активны с прошлого периода.
     *       Сколько объявлений остаются опубликованными с предыдущего периода.
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад список данных группировок статистики `result.groupings`
     *       и общее количество сущностей `result.dataTotalCount`.
     *
     *     #### Данные группировки
     *
     *     - `id` — идентификатор объявления или временная метка (зависит от типа группировки).
     *     - `type` — группировка показателей.
     *     - `metrics` — список данных статистических показателей.
     *       Представлен массивом объектов: `slug` — показатель, `value` — значение показателя.
     *
     *     ### Примечания
     *
     *     - Метод имеет ограничение до 100 запросов в минуту.
     *     - Глубина данных статистики ограничена 270 днями.
     *     - Показатель не возвращается, если он не доступен для клиента.
     */
    post: operations['statsAccountsItems']
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
  '/stats/v2/accounts/{user_id}/spendings': {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    get?: never
    put?: never
    /**
     * Получение статистики расходов клиента
     * @description Данный метод позволяет получить статистику расходов клиента.
     *
     *     ### Доступ к данным клиента
     *
     *     Для того, чтобы получить данные статистики конкретного клиента,
     *       необходимо указать идентификатор аккаунта клиента в качестве значения параметра URL `user_id`,
     *       а также значения заголовка `X-AgencyClientId`!
     *
     *     ### Параметры тела запроса
     *
     *     - `dateFrom` — дата в формате `YYYY-MM-DD`, с которой требуется получить статистику.
     *     - `dateTo` — дата в формате `YYYY-MM-DD`, по которую требуется получить статистику (включительно).
     *     - `grouping` — группировка расходов.
     *     - `spendingTypes` — массив необходимых категорий расходов.
     *
     *     Добавьте ограничения `filter`, если нужно отфильтровать данные статистики:
     *
     *     - `categoryIDs` — по категориям (идентификаторы). См. доступные значения в
     *       [Справочнике идентификаторов категорий](https://www.avito.st/s/openapi/catalog-categories.xml).
     *     - `itemIDs` — по объявлениям (идентификаторы).
     *
     *     #### Группировка расходов
     *
     *     - `day` — группировка по дням.
     *     - `week` — группировка по неделям.
     *     - `month` — группировка по месяцам.
     *
     *     #### Категория расходов
     *
     *     - `promotion` — продвижение объявлений.
     *     - `presence` — размещение и целевые действия.
     *     - `commission` — комиссия.
     *     - `rest` — остальное.
     *
     *     Чтобы включить в ответ все категории расходов,
     *       можно в качестве значения входного параметра `spendingTypes` указать `["all"]` — все расходы.
     *
     *     ### Успешный ответ
     *
     *     Метод возвращает назад список данных группировок статистики `result.groupings`
     *       и временную метку получения данных статистики `result.timestamp`.
     *
     *     #### Данные группировки
     *
     *     - `date` — дата группировки расходов в формате `YYYY-MM-DD`.
     *     - `type` — группировка расходов.
     *     - `spendings` — список данных категории расходов.
     *
     *     #### Данные категории расходов
     *
     *     - `slug` — категория расходов.
     *     - `value` — сумма расходов в рублях.
     *     - `services` — список данных расходов категории по услугам.
     *
     *     #### Данные расходов категории
     *
     *     - `slug` — услуга.
     *     - `value` — сумма расходов в рублях.
     *
     *     #### Услуга
     *
     *     - `bbip` — Продвижение с прогнозом просмотров.
     *     - `perf_vas` — ×2, ×5, ×10 и другие.
     *     - `vas_xl` — XL-объявление.
     *     - `vas_highlight` — Выделение цветом.
     *     - `sbc_discount` — Рассылка скидок.
     *     - `vas_sticker` — Значки на XL-объявлении.
     *     - `vas_package` — Пакеты продвижения.
     *     - `orders_commission` — Комиссия за заказы.
     *     - `bookings_commission` — Комиссия за бронирования.
     *     - `delivery_subsidy` — Cкидка на доставку для покупателей.
     *     - `fbs_commission` — Комиссия за услугу «кросс-доставка».
     *     - `courier_pickup` — Услуги курьера для забора товара у продавца.
     *     - `tariff_listing` — Размещения из тарифа.
     *     - `lf` — Разовые размещения.
     *     - `tariff_remainder` — Неиспользованные размещения.
     *     - `cpa_click_package` — Целевые просмотры.
     *     - `cpa_target_call` — Целевые звонки.
     *     - `cpa_target_chat` — Целевые чаты.
     *     - `cpa_job_contact` — Отклики.
     *     - `service_fee` — Объявления сверх лимита.
     *     - `cpa_rfp_contact` — Целевые лиды.
     *     - `cpa_transfer_select` — Лиды Селекта.
     *     - `profile_promo` — Продвижение профиля.
     *     - `profile_promo_v2` — Реклама профиля.
     *     - `tariff_ext` — Подписка на инструменты.
     *     - `chat_bot` — Чат-боты.
     *     - `cv` — Пакеты резюме.
     *     - `other` — Другое.
     *
     *     ### Примечания
     *
     *     - Метод имеет ограничение до 100 запросов в минуту.
     *     - Глубина данных статистики ограничена 510 днями.
     */
    post: operations['statsAccountsSpendings']
    delete?: never
    options?: never
    head?: never
    patch?: never
    trace?: never
  }
}
export type webhooks = Record<string, never>
export interface components {
  schemas: {
    /**
     * Format: double
     * @description Сумма в рублях
     * @example 1000
     */
    amountDouble: number
    /**
     * @description Сумма в копейках
     * @example 100000
     */
    amountKopecks: number
    /**
     * @description Статус ответа
     * @example bad-request
     * @enum {string}
     */
    badRequestResponseStatus: 'bad-request'
    /**
     * @description Счетчик
     * @example 123
     */
    counter: number
    /**
     * Format: date
     * @description Дата в формате YYYY-MM-DD
     * @example 2025-05-02
     */
    date: string
    /**
     * Format: date-time
     * @description Дата в формате RFC3339
     * @example 2025-05-02T11:00:00+03:00
     */
    dateTime: string
    defaultErrorResponse: {
      /** @description Ошибка */
      error: {
        code: components['schemas']['errorCode']
        message: components['schemas']['errorMessage']
      }
    }
    /**
     * @description Код ошибки
     * @example 1001
     */
    errorCode: number
    /**
     * @description Наименование поля
     * @example userId
     */
    errorField: string
    /** @description Ошибки валидации */
    errorFields: {
      field: components['schemas']['errorField']
      message: components['schemas']['errorMessage']
    }[]
    /**
     * @description Сообщение об ошибке
     * @example Ошибка
     */
    errorMessage: string
    errorResponse: {
      result: components['schemas']['errorResult']
    }
    /** @description Результат с ошибкой */
    errorResult: {
      message: components['schemas']['errorMessage']
    }
    /**
     * @description Статус ответа
     * @example forbidden
     * @enum {string}
     */
    forbiddenResponseStatus: 'forbidden'
    /**
     * @description Идентификатор
     * @example 123456
     */
    id: number
    /** @description Список идентификаторов */
    ids: components['schemas']['id'][]
    /**
     * @description ИНН
     * @example 1234567890
     */
    inn: string
    /** @description Идентификатор приглашения нового клиента */
    inviteId: {
      inviteId: components['schemas']['id']
    }
    /**
     * @description Номер страницы объявлений
     * @example 1
     */
    itemPage: number
    /**
     * @description Количество объявлений на странице
     * @example 25
     */
    itemPerPage: number
    /**
     * @description Статус объявления на сайте
     * @enum {string}
     */
    itemStatus: 'active' | 'removed' | 'old' | 'blocked' | 'rejected'
    /**
     * @description URL-адрес объявления
     * @example https://www.avito.ru/sankt-peterburg/gotoviy_biznes/vendingovye_avtomaty_123
     */
    itemURL: string
    /**
     * @description Ограничение количества сущностей в выборке
     * @example 100
     */
    limit: number
    /**
     * @description Тип связи с клиентом
     * @example adv
     * @enum {string}
     */
    linkType: 'adv' | 'trx'
    /**
     * @description Статус ответа
     * @example not-found
     * @enum {string}
     */
    notFoundResponseStatus: 'not-found'
    /**
     * @description Смещение, с которого начинается выборка
     * @example 10
     */
    offset: number
    /**
     * @description Статус результата ответа
     * @example ok
     * @enum {string}
     */
    okResponseStatus: 'ok'
    /**
     * @description Показатель статистики
     * @example views
     * @enum {string}
     */
    statsMetric:
      | 'views'
      | 'contacts'
      | 'contactsShowPhone'
      | 'contactsMessenger'
      | 'contactsShowPhoneAndMessenger'
      | 'contactsSbcDiscount'
      | 'viewsToContactsConversion'
      | 'favorites'
      | 'averageViewCost'
      | 'averageContactCost'
      | 'impressions'
      | 'impressionsToViewsConversion'
      | 'clickPackages'
      | 'jobContacts'
      | 'viewsToOrderedItemsConversion'
      | 'orderedItems'
      | 'orderedItemsPrice'
      | 'deliveredItems'
      | 'deliveredItemsPrice'
      | 'bookingPlacedCount'
      | 'bookingPlacedPrice'
      | 'bookingApprovedCount'
      | 'bookingApprovedPrice'
      | 'bookingAcceptedCount'
      | 'bookingAcceptedPrice'
      | 'allSpending'
      | 'spending'
      | 'presenceSpending'
      | 'promoSpending'
      | 'restSpending'
      | 'commission'
      | 'spendingBonus'
      | 'activeItems'
      | 'newActiveItems'
      | 'oldActiveItems'
    /**
     * @description Тип группировки показателей
     * @example month
     * @enum {string}
     */
    statsMetricsGrouping: 'day' | 'week' | 'month' | 'totals'
    /**
     * @description Тип группировки расходов
     * @example month
     * @enum {string}
     */
    statsSpendingsGrouping: 'day' | 'week' | 'month'
    /** @description Идентификатор задачи проверки ИНН клиентов */
    targetTaskId: {
      taskId: components['schemas']['id']
    }
    /**
     * @description Временная метка
     * @example 1598958000
     */
    timestamp: number
    /**
     * @description Переключатель
     * @example true
     */
    toggle: boolean
    /**
     * @description Идентификатор транзакции
     * @example b52717c26fbc027acc34f165490fd4fdf404f3aa
     */
    transactionId: string
    /**
     * @description Статус транзакции
     * @example success
     * @enum {string}
     */
    transactionStatus: 'processing' | 'success' | 'error'
    /**
     * @description Статус ответа
     * @example unauthorized
     * @enum {string}
     */
    unauthorizedResponseStatus: 'unauthorized'
    validationErrorResponse: {
      /** @description Ошибка валидации */
      error: {
        code: components['schemas']['errorCode']
        /** @description Валидация полей */
        fields?: {
          [key: string]: components['schemas']['errorMessage']
        }
        message: components['schemas']['errorMessage']
      }
    }
  }
  responses: {
    /** @description Неверный запрос */
    badRequestFields: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': {
          result: components['schemas']['errorFields']
        }
      }
    }
    /** @description Неверный запрос */
    badRequestFieldsWithStatus: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': {
          result: components['schemas']['errorFields']
          status: components['schemas']['badRequestResponseStatus']
        }
      }
    }
    /** @description Неверный запрос */
    badRequestValidation: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': components['schemas']['validationErrorResponse']
      }
    }
    /** @description Неверный запрос */
    badRequestWithStatus: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': {
          result: components['schemas']['errorResult']
          status: components['schemas']['badRequestResponseStatus']
        }
      }
    }
    /** @description Неверный запрос */
    defaultBadRequest: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': components['schemas']['defaultErrorResponse']
      }
    }
    /** @description Действие запрещено */
    defaultForbidden: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': components['schemas']['defaultErrorResponse']
      }
    }
    /** @description Ошибка сервера */
    defaultInternalServerError: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': components['schemas']['defaultErrorResponse']
      }
    }
    /** @description Не найдено */
    defaultNotFound: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': components['schemas']['defaultErrorResponse']
      }
    }
    /** @description Превышено количество запросов */
    defaultTooManyRequests: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': components['schemas']['defaultErrorResponse']
      }
    }
    /** @description Требуется авторизация */
    defaultUnauthorized: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': components['schemas']['defaultErrorResponse']
      }
    }
    /** @description Действие запрещено */
    forbidden: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': components['schemas']['errorResponse']
      }
    }
    /** @description Действие запрещено */
    forbiddenWithStatus: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': {
          result: components['schemas']['errorResult']
          status: components['schemas']['forbiddenResponseStatus']
        }
      }
    }
    /** @description Не найдено */
    notFound: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': components['schemas']['errorResponse']
      }
    }
    /** @description Не найдено */
    notFoundWithStatus: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': {
          result: components['schemas']['errorResult']
          status: components['schemas']['notFoundResponseStatus']
        }
      }
    }
    /** @description Требуется авторизация */
    unauthorized: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': components['schemas']['errorResponse']
      }
    }
    /** @description Требуется авторизация */
    unauthorizedWithStatus: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': {
          result: components['schemas']['errorResult']
          status: components['schemas']['unauthorizedResponseStatus']
        }
      }
    }
    /** @description Неподдерживаемый запрос */
    unprocessableEntity: {
      headers: {
        [name: string]: unknown
      }
      content: {
        'application/json': components['schemas']['validationErrorResponse']
      }
    }
  }
  parameters: {
    /** @description Идентификатор пользователя клиента */
    agencyClientIdHeader: components['schemas']['id']
    /** @description Токен для авторизации */
    authHeader: string
    /** @description Идентификатор транзакции */
    transactionIdPathParameter: components['schemas']['transactionId']
    /** @description Идентификатор пользователя клиента */
    userIdPathParameter: components['schemas']['id']
  }
  requestBodies: never
  headers: never
  pathItems: never
}
export type $defs = Record<string, never>
export interface operations {
  agencyBalance: {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    /** @description Тело запроса */
    requestBody: {
      content: {
        'application/json': {
          /**
           * @description Сумма в рублях
           * @example 1000
           */
          amount: number
          userId: components['schemas']['id']
        }
      }
    }
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            /** @description Результат перевода средств на счёт клиента */
            result: {
              /**
               * @description Причина текущего статуса транзакции
               * @example Создан запрос на перевод средств
               */
              reason: string
              /**
               * @description Статус транзакции
               * @example processing
               * @enum {string}
               */
              status: 'processing' | 'error'
              transactionId: components['schemas']['transactionId']
            }
          }
        }
      }
      400: components['responses']['badRequestFields']
      401: components['responses']['unauthorized']
      403: components['responses']['unauthorized']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  agencyTransactions: {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    requestBody?: never
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            /** @description Информация о незавершённых транзакциях */
            result: {
              status: components['schemas']['transactionStatus']
              transactionId: components['schemas']['transactionId']
            }[]
          }
        }
      }
      400: components['responses']['badRequestFields']
      401: components['responses']['unauthorized']
      403: components['responses']['unauthorized']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  agencyTransaction: {
    parameters: {
      query?: never
      header?: never
      path: {
        /** @description Идентификатор транзакции */
        transaction_id: components['parameters']['transactionIdPathParameter']
      }
      cookie?: never
    }
    requestBody?: never
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            /** @description Информация о транзакции */
            result: {
              message?: components['schemas']['errorMessage']
              status: components['schemas']['transactionStatus']
              transactionId: components['schemas']['transactionId']
            }
          }
        }
      }
      400: components['responses']['badRequestFields']
      401: components['responses']['unauthorized']
      403: components['responses']['forbidden']
      404: components['responses']['notFound']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  agencyClients: {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    /** @description Тело запроса */
    requestBody: {
      content: {
        'application/json': {
          /** @description Настройка дополнительной информации о клиентах */
          extra?: {
            advance?: components['schemas']['toggle']
            balance?: components['schemas']['toggle']
            statistics?: components['schemas']['toggle']
            subscription?: components['schemas']['toggle']
          }
          /**
           * @description Ограничение количества сущностей в выборке
           * @example 100
           */
          limit: number
          offset?: components['schemas']['offset']
        }
      }
    }
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            /** @description Информация о клиентах */
            result: {
              /** @description Список клиентов */
              clients: {
                /** @description Информация о балансе аванса тарифа клиента */
                advance?: {
                  amount: components['schemas']['amountKopecks']
                }
                /** @description Информация о балансе Кошелька клиента */
                balance?: {
                  amount: components['schemas']['amountKopecks']
                }
                clientId: components['schemas']['id']
                linkTime: components['schemas']['dateTime']
                linkType: components['schemas']['linkType']
                mainUserId?: components['schemas']['id']
                /**
                 * @description Наименование клиента
                 * @example Клиент
                 */
                name: string
                /** @description Статистика клиента */
                statistics?: {
                  activeItems: components['schemas']['counter']
                  clicks: components['schemas']['counter']
                  spendings: components['schemas']['amountKopecks']
                  views: components['schemas']['counter']
                }
                /**
                 * @description Статус клиента
                 * @example active
                 * @enum {string}
                 */
                status: 'new' | 'active'
                /** @description Информация о подписке клиента */
                subscription?: {
                  /**
                   * @description Категория подписки клиента
                   * @example goods
                   * @enum {string}
                   */
                  category: 'auto' | 'realty' | 'services' | 'job' | 'goods'
                  expiredTo?: components['schemas']['dateTime']
                  isActive: components['schemas']['toggle']
                  /**
                   * @description Уровень подписки клиента
                   * @example maximal
                   * @enum {string}
                   */
                  level: 'basic' | 'extended' | 'maximal' | 'ultra'
                }
              }[]
              total: components['schemas']['counter']
            }
            status: components['schemas']['okResponseStatus']
          }
        }
      }
      400: components['responses']['badRequestFieldsWithStatus']
      401: components['responses']['unauthorizedWithStatus']
      403: components['responses']['forbiddenWithStatus']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  agencyClientsTargetCreate: {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    /** @description Тело запроса */
    requestBody: {
      content: {
        'application/json': {
          /** @description Список ИНН */
          innList: components['schemas']['inn'][]
        }
      }
    }
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            result: components['schemas']['targetTaskId']
            status: components['schemas']['okResponseStatus']
          }
        }
      }
      400: components['responses']['badRequestFieldsWithStatus']
      401: components['responses']['unauthorizedWithStatus']
      403: components['responses']['forbiddenWithStatus']
      404: components['responses']['notFoundWithStatus']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  agencyClientsTargetResult: {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    /** @description Тело запроса */
    requestBody: {
      content: {
        'application/json': components['schemas']['targetTaskId']
      }
    }
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            /** @description Информация о проверке ИНН клиентов */
            result: {
              /** @description Список результатов проверки ИНН клиентов */
              items: {
                inn: components['schemas']['inn']
                /**
                 * @description Наличие ошибки при проверке ИНН клиента
                 * @example false
                 */
                isError: boolean
                /** @description Результаты проверки ИНН клиента по категориям */
                results: {
                  /**
                   * @description Категория
                   * @example goods
                   * @enum {string}
                   */
                  category: 'goods' | 'services' | 'machinery' | 'jobs'
                  /**
                   * @description Статус ИНН клиента в категории
                   * @example new
                   * @enum {string}
                   */
                  status: 'new' | 'uplift' | 'unavailable'
                }[]
              }[]
              /**
               * @description Статус задачи проверки ИНН клиентов
               * @example success
               * @enum {string}
               */
              status: 'pending' | 'success'
            }
            status: components['schemas']['okResponseStatus']
          }
        }
      }
      400: components['responses']['badRequestFieldsWithStatus']
      401: components['responses']['unauthorizedWithStatus']
      403: components['responses']['forbiddenWithStatus']
      404: components['responses']['notFoundWithStatus']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  agencyFinancesBalance: {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    requestBody?: never
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            full: components['schemas']['amountKopecks']
            pending: components['schemas']['amountKopecks']
          }
        }
      }
      400: components['responses']['defaultBadRequest']
      401: components['responses']['defaultUnauthorized']
      403: components['responses']['defaultForbidden']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  agencyFinancesTransactionsHistory: {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    /** @description Тело запроса */
    requestBody: {
      content: {
        'application/json': {
          dateFrom: components['schemas']['dateTime']
          dateTo: components['schemas']['dateTime']
          limit: components['schemas']['limit']
          offset: components['schemas']['offset']
        }
      }
    }
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            /** @description Информация об операциях с балансом агентства */
            items: {
              amount: components['schemas']['amountKopecks']
              clientId?: components['schemas']['id']
              operationDateTime: components['schemas']['dateTime']
              /**
               * @description Статус транзакции
               * @example success
               * @enum {string}
               */
              status: 'pending' | 'success' | 'blocked' | 'failed'
              transactionId: components['schemas']['transactionId']
            }[]
          }
        }
      }
      400: components['responses']['defaultBadRequest']
      401: components['responses']['defaultUnauthorized']
      403: components['responses']['defaultForbidden']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  agencyUsersInviteSend: {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    /** @description Тело запроса */
    requestBody: {
      content: {
        'application/json': {
          type: components['schemas']['linkType']
          userId: components['schemas']['id']
        }
      }
    }
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            result: components['schemas']['inviteId']
            status: components['schemas']['okResponseStatus']
          }
        }
      }
      400: components['responses']['badRequestWithStatus']
      401: components['responses']['unauthorized']
      403: components['responses']['forbidden']
      404: components['responses']['notFoundWithStatus']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  agencyUsersInviteStatus: {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    /** @description Тело запроса */
    requestBody: {
      content: {
        'application/json': components['schemas']['inviteId']
      }
    }
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            /** @description Информация о приглашении нового клиента */
            result: {
              /**
               * @description Статус приглашения нового клиента
               * @example success
               * @enum {string}
               */
              status: 'pending' | 'success' | 'decline'
            }
            status: components['schemas']['okResponseStatus']
          }
        }
      }
      400: components['responses']['badRequestFieldsWithStatus']
      401: components['responses']['unauthorized']
      403: components['responses']['forbidden']
      404: components['responses']['notFoundWithStatus']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  agencyUsersVerificationStatus: {
    parameters: {
      query?: never
      header?: never
      path?: never
      cookie?: never
    }
    /** @description Тело запроса */
    requestBody: {
      content: {
        'application/json': components['schemas']['inviteId']
      }
    }
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            /** @description Информация о статусе верификации нового клиента */
            result: {
              agencyClientUserId?: components['schemas']['id']
              /**
               * @description Статус верификации нового клиента
               * @example verified
               * @enum {string}
               */
              status: 'verified' | 'not-verified'
              userId: components['schemas']['id']
            }
            status: components['schemas']['okResponseStatus']
          }
        }
      }
      400: components['responses']['badRequestFieldsWithStatus']
      401: components['responses']['unauthorized']
      403: components['responses']['forbidden']
      404: components['responses']['notFoundWithStatus']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  coreItem: {
    parameters: {
      query?: never
      header: {
        /** @description Идентификатор пользователя клиента */
        'X-AgencyClientId': components['parameters']['agencyClientIdHeader']
      }
      path: {
        /** @description Идентификатор пользователя клиента */
        user_id: components['parameters']['userIdPathParameter']
        /** @description Идентификатор объявления */
        item_id: components['schemas']['id']
      }
      cookie?: never
    }
    requestBody?: never
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            /**
             * @description Идентификатор объявления из файла автозагрузки
             * @example xjfdge4735200
             */
            autoload_item_id?: string
            finish_time?: components['schemas']['dateTime']
            start_time?: components['schemas']['dateTime']
            status: components['schemas']['itemStatus']
            url: components['schemas']['itemURL']
            /** @description Список применённых платных услуг */
            vas: {
              finish_time?: components['schemas']['dateTime']
              /**
               * @description Идентификатор услуги
               * @example highlight
               */
              vas_id: string
            }[]
          }
        }
      }
      401: components['responses']['defaultUnauthorized']
      403: components['responses']['defaultForbidden']
      404: components['responses']['defaultNotFound']
      422: components['responses']['unprocessableEntity']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  coreItems: {
    parameters: {
      query?: {
        /** @description Статус объявления на сайте */
        status?: string
        /** @description Идентификатор категории объявления */
        category?: components['schemas']['id']
        /** @description Дата обновления/редактирования объявления */
        updatedAtFrom?: components['schemas']['date']
        /** @description Количество объявлений на странице */
        per_page?: components['schemas']['itemPerPage']
        /** @description Номер страницы */
        page?: components['schemas']['itemPage']
      }
      header: {
        /** @description Идентификатор пользователя клиента */
        'X-AgencyClientId': components['parameters']['agencyClientIdHeader']
      }
      path?: never
      cookie?: never
    }
    requestBody?: never
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            /** @description Мета-информация */
            meta: {
              page: components['schemas']['itemPage']
              per_page: components['schemas']['itemPerPage']
            }
            /** @description Список объявлений */
            resources: {
              /**
               * @description Адрес объявления
               * @example Санкт-Петербург, пр-т Будённого, 2021
               */
              address: string
              /** @description Категория объявления */
              category: {
                id?: components['schemas']['id']
                /**
                 * @description Наименование категории
                 * @example Готовый бизнес
                 */
                name?: string
              }
              id: components['schemas']['id']
              /**
               * @description Цена объявления
               * @example 120560
               */
              price?: number
              status: components['schemas']['itemStatus']
              /**
               * @description Название объявления
               * @example Вендинговые автоматы
               */
              title: string
              url: components['schemas']['itemURL']
            }
          }
        }
      }
      400: components['responses']['badRequestValidation']
      401: components['responses']['defaultUnauthorized']
      403: components['responses']['defaultForbidden']
      404: components['responses']['defaultNotFound']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  statsAccountsItems: {
    parameters: {
      query?: never
      header: {
        /** @description Идентификатор пользователя клиента */
        'X-AgencyClientId': components['parameters']['agencyClientIdHeader']
      }
      path: {
        /** @description Идентификатор пользователя клиента */
        user_id: components['parameters']['userIdPathParameter']
      }
      cookie?: never
    }
    /** @description Тело запроса */
    requestBody: {
      content: {
        'application/json': {
          dateFrom: components['schemas']['date']
          dateTo: components['schemas']['date']
          /** @description Набор ограничений, по которым будут отфильтрованы данные статистики */
          filter?: {
            categoryIDs?: components['schemas']['ids']
            employeeIDs?: components['schemas']['ids']
          }
          grouping: components['schemas']['statsMetricsGrouping']
          limit?: components['schemas']['limit']
          /** @description Набор показателей, которые должны быть в статистике */
          metrics: components['schemas']['statsMetric'][]
          offset?: components['schemas']['offset']
          /** @description Сортировка данных статистики */
          sort?: {
            key: components['schemas']['statsMetric']
            /**
             * @description Порядок сортировки
             * @example asc
             * @enum {string}
             */
            order: 'asc' | 'desc'
          }
        }
      }
    }
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            /** @description Статистические показатели клиента */
            result: {
              dataTotalCount: components['schemas']['counter']
              /** @description Группировки статистических показателей клиента */
              groupings: {
                id: components['schemas']['id']
                /** @description Статистические показатели */
                metrics: {
                  slug: components['schemas']['statsMetric']
                  value: components['schemas']['counter']
                }[]
                type: components['schemas']['statsMetricsGrouping']
              }[]
            }
          }
        }
      }
      400: components['responses']['defaultBadRequest']
      401: components['responses']['defaultUnauthorized']
      403: components['responses']['defaultForbidden']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
  statsAccountsSpendings: {
    parameters: {
      query?: never
      header: {
        /** @description Идентификатор пользователя клиента */
        'X-AgencyClientId': components['parameters']['agencyClientIdHeader']
      }
      path: {
        /** @description Идентификатор пользователя клиента */
        user_id: components['parameters']['userIdPathParameter']
      }
      cookie?: never
    }
    /** @description Тело запроса */
    requestBody: {
      content: {
        'application/json': {
          dateFrom: components['schemas']['date']
          dateTo: components['schemas']['date']
          /** @description Набор ограничений, по которым будут отфильтрованы данные статистики */
          filter?: {
            categoryIDs?: components['schemas']['ids']
            itemIDs?: components['schemas']['ids']
          }
          grouping: components['schemas']['statsSpendingsGrouping']
          /** @description Набор категорий расходов клиента */
          spendingTypes: ('all' | 'promotion' | 'presence' | 'commission' | 'rest')[]
        }
      }
    }
    responses: {
      /** @description Успешный ответ */
      200: {
        headers: {
          [name: string]: unknown
        }
        content: {
          'application/json': {
            /** @description Статистика расходов клиента */
            result: {
              /** @description Группировки расходов клиента */
              groupings: {
                date: components['schemas']['date']
                /** @description Категории расходов */
                spendings: {
                  /** @description Расходы по услугам */
                  services: {
                    /**
                     * @description Слаг услуг
                     * @example vas_xl
                     * @enum {string}
                     */
                    slug:
                      | 'bbip'
                      | 'perf_vas'
                      | 'vas_xl'
                      | 'vas_highlight'
                      | 'sbc_discount'
                      | 'vas_sticker'
                      | 'vas_package'
                      | 'orders_commission'
                      | 'bookings_commission'
                      | 'delivery_subsidy'
                      | 'fbs_commission'
                      | 'courier_pickup'
                      | 'tariff_listing'
                      | 'lf'
                      | 'tariff_remainder'
                      | 'cpa_click_package'
                      | 'cpa_target_call'
                      | 'cpa_target_chat'
                      | 'cpa_job_contact'
                      | 'service_fee'
                      | 'cpa_rfp_contact'
                      | 'cpa_transfer_select'
                      | 'profile_promo'
                      | 'profile_promo_v2'
                      | 'tariff_ext'
                      | 'chat_bot'
                      | 'cv'
                      | 'other'
                    value: components['schemas']['amountDouble']
                  }[]
                  /**
                   * @description Слаг категории расходов
                   * @example promotion
                   * @enum {string}
                   */
                  slug: 'promotion' | 'presence' | 'commission' | 'rest'
                  value: components['schemas']['amountDouble']
                }[]
                type: components['schemas']['statsSpendingsGrouping']
              }[]
              timestamp: components['schemas']['timestamp']
            }
          }
        }
      }
      400: components['responses']['defaultBadRequest']
      401: components['responses']['defaultUnauthorized']
      403: components['responses']['defaultForbidden']
      429: components['responses']['defaultTooManyRequests']
      500: components['responses']['defaultInternalServerError']
    }
  }
}
